public/programming/emacs/elisp-exercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orgec44f8b" class="outline-2">
<h2 id="orgec44f8b">Emacs-lisp Exercises</h2>
<div class="outline-text-2" id="text-orgec44f8b">
<p>
Here is a collection of some emacs lisp exercises that I come up by
myself when learning the syntax. Emacs lisp is quite a simple
language, and It is very powerful because It integrates with emacs
"natively". You can easily manage buffers, windows, keys and UI with
ease, so I want to dedicate some time into this.
</p>
</div>

<div id="outline-container-org556bf21" class="outline-3">
<h3 id="org556bf21">Basics</h3>
<div class="outline-text-3" id="text-org556bf21">
<p>
Define a variable a using <code>setq</code> with the value "Hello World".
Variables are used to store the state such as the current
configuration of a package, so changing a variable's value
directly changes the configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">setq</span> a <span style="color: #2544bb;">"Hello-World"</span>)
</pre>
</div>

<p>
Lists are the most common data structures in lisp. To declare a
list, you need to prepend the white space separated elements
enclosed int parenthesys <code>( )</code> with a <code>'</code> character.
By default, a list does not evaluate It's element when the list
itself gets evaluated. To break this rule, you can use the <code>`</code>
character to represent a list that may be "escaped" with the <code>,</code>
character.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">'(1 2 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-org00f0517" class="outline-3">
<h3 id="org00f0517">Functions</h3>
<div class="outline-text-3" id="text-org00f0517">
<p>
Sum two numbers toghether. You can use the <code>+</code> function which
takes any number of arguments that are either numbers or markers.
To call a function, you surround the function name and Its
argument in parenthesys <code>(...)</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(+ 1 2)  
</pre>
</div>

<p>
Call the <code>message</code> function to write a message to the message
buffer. The message function works similarly to libc's printf.
</p>

<p>
To get information about function, you can call <code>describe-function</code>
from the minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(message <span style="color: #2544bb;">"Hello World"</span>)
</pre>
</div>

<p>
Define a function to write hello and another to write bye to the
message buffer. Use <code>defun</code>, followed by the function name,
arguments, and body.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">defun</span> <span style="color: #721045;">print-hello</span> ()
  (message <span style="color: #2544bb;">"Hello World!"</span>))
(<span style="color: #5317ac;">defun</span> <span style="color: #721045;">print-bye</span> ()
  (message <span style="color: #2544bb;">"Bye bye!"</span>))
</pre>
</div>

<p>
Define a function that says either hello or bye depending on
whether the number of iteration taken from the user is odd or
even.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">defun</span> <span style="color: #721045;">hello-or-bye</span> (iterations)
  (<span style="color: #5317ac;">setq</span> a iterations)
  (<span style="color: #5317ac;">while</span> (&gt;= a 0)
    (<span style="color: #5317ac;">if</span> (= 0 (% a 2))
  (print-hello)
      (print-bye))
    (<span style="color: #5317ac;">setq</span> a (- a 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ea5135" class="outline-3">
<h3 id="org3ea5135">Iteration</h3>
<div class="outline-text-3" id="text-org3ea5135">
<p>
Define a function to iterate over a list supplied by the user and
output to a buffer in another window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">defun</span> <span style="color: #721045;">iterate-now</span> (list)
  <span style="color: #2a486a;">"Print elements of a list"</span>
  (<span style="color: #5317ac;">setq</span> mybuff (generate-new-buffer <span style="color: #2544bb;">"*my output*"</span>))
  (<span style="color: #5317ac;">while</span> list
    (print (car list) mybuff)
    (<span style="color: #5317ac;">setq</span> list (cdr list)))
  (switch-to-buffer-other-window mybuff))

<span style="color: #505050;">;; </span><span style="color: #505050;">Call that function</span>
<span style="color: #505050;">;;</span><span style="color: #505050;">(iterate-now '(c c++ rust c3))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dfbdbe" class="outline-3">
<h3 id="org1dfbdbe">Custom types</h3>
<div class="outline-text-3" id="text-org1dfbdbe">
<p>
Define a variable with <code>defvar</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">defvar</span> <span style="color: #00538b;">food-list</span> '(bread pasta pizza) <span style="color: #2a486a;">"A list of Italian food"</span>)
</pre>
</div>

<p>
Define a variable with defcustom.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">defgroup</span> <span style="color: #005a5f;">italian</span> nil <span style="color: #2a486a;">"Italian things"</span>)
(<span style="color: #5317ac;">defcustom</span> <span style="color: #00538b;">city-list</span> '(<span style="color: #2544bb;">"Rome"</span> <span style="color: #2544bb;">"Milan"</span> <span style="color: #2544bb;">"Trento"</span>)
  <span style="color: #2a486a;">"A list of Italian cities"</span>
  <span style="color: #8f0075;">:group</span> 'italian
  <span style="color: #8f0075;">:type</span> '(repeat string))
<span style="color: #505050;">;;</span><span style="color: #505050;">(iterate-now city-list)</span>
</pre>
</div>

<p>
Define a function that returns true only if Its argument is a
list of strings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac;">require</span> '<span style="color: #0000c0;">cl-lib</span>)
(<span style="color: #5317ac;">defun</span> <span style="color: #721045;">is-string-list</span> (obj)
  <span style="color: #2a486a;">"Find out if the argument is a list of string"</span>
  (<span style="color: #5317ac;">and</span> (listp obj)
       (cl-every #'stringp obj)))

<span style="color: #505050;">;; </span><span style="color: #505050;">Test the function</span>
(<span style="color: #5317ac;">if</span> (not (is-string-list city-list))
    (message <span style="color: #2544bb;">"upsie"</span>)
  (message <span style="color: #2544bb;">"ok"</span>))
(<span style="color: #5317ac;">if</span> (is-string-list 123)
    (message <span style="color: #2544bb;">"upsie 2"</span>)
  (message <span style="color: #2544bb;">"ok"</span>))
</pre>
</div>

<p>
Of course, the language goes really deep and I barely scratched
the surface. I will keep doing exercises untill I feel satisfied.
</p>

<p>
&#x2014;
</p>

<p>
Go Back: <a href="emacs.html">emacs.html</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
